using UnityEngine;
using System.Collections.Generic;
using Newtonsoft.Json;
using System.IO;

public class RES_DATA : MonoBehaviour
{
    //-----------------------------------------------------------------------------------------------------------------
    //-----------------------------------------------------------------------------------------------------------------
    // всего денег
    protected static int SCORE_MONEY;
    //-----------------------------------------------------------------------------------------------------------------
    //-----------------------------------------------------------------------------------------------------------------






    //-----------------------------------------------------------------------------------------------------------------
    //-----------------------------------------------------------------------------------------------------------------
    // УЖЕ ДОБЫВАЕМЫЕ РЕСУРСЫ
    protected static Dictionary<string, STRCT_RES_TYP> RES = new Dictionary<string, STRCT_RES_TYP>()
    {
        {"BLACK", new STRCT_RES_TYP("BLACK", 0, 1.0f, 1) },
        {"GLASS", new STRCT_RES_TYP("GLASS", 0, 1.8f, 1) },
        {"GREEN", new STRCT_RES_TYP("GREEN", 0, 2.5f, 1) },
    };

    public class STRCT_RES_TYP
    {
        public int          SCORE;          // всего ресурсов
        public float        TS_GET;         // время следующего получения
        public float        TS_Interval;    // интервал между получениями
        public int          GET_V;          // скольуо получаем

        public STRCT_RES_TYP(string NAME, int _SCORE, float _TS_Interval, int _GET_V)
        {
            SCORE           = _SCORE;
            TS_GET          = 0;
            TS_Interval     = _TS_Interval;
            GET_V           = _GET_V;
        }
    }
    //-----------------------------------------------------------------------------------------------------------------
    //-----------------------------------------------------------------------------------------------------------------
}
