using System.Collections.Generic;
using TMPro;
using UnityEngine;
using UnityEngine.UI;

public class UI_RES : RES_DATA
{
    //-----------------------------------------------------------------------------------------------------------------
    //-----------------------------------------------------------------------------------------------------------------
    protected static TextMeshProUGUI MONEY_TXT;
    protected static Dictionary<int, TextMeshProUGUI> RES_TXT;
    //-----------------------------------------------------------------------------------------------------------------
    //-----------------------------------------------------------------------------------------------------------------



    //-----------------------------------------------------------------------------------------------------------------
    //-----------------------------------------------------------------------------------------------------------------
    // “≈ —“€ «Õ¿◊≈Õ»ﬂ –≈—”–—Œ¬
    public static void UI_RES_INIT()
    {
        MONEY_TXT = GameObject.Find("/Canvas/AMOUNT/MONEY/TXT").GetComponent<TextMeshProUGUI>();

        RES_TXT = new Dictionary<int, TextMeshProUGUI>()
        {
            {1, GameObject.Find("/Canvas/AMOUNT/RES/1/TXT")  .GetComponent<TextMeshProUGUI>()},
            {2, GameObject.Find("/Canvas/AMOUNT/RES/2/TXT")  .GetComponent<TextMeshProUGUI>()},
            {3, GameObject.Find("/Canvas/AMOUNT/RES/3/TXT")  .GetComponent<TextMeshProUGUI>()},
        };
    }
    //-----------------------------------------------------------------------------------------------------------------
    //-----------------------------------------------------------------------------------------------------------------



    //-----------------------------------------------------------------------------------------------------------------
    //-----------------------------------------------------------------------------------------------------------------
    // ”—“¿ÕŒ¬»“‹ » ŒÕ » –≈—”–—Œ¬
    public static void UI_RES_ICON_INIT(int COUNT)
    {
        foreach(KeyValuePair<int, TextMeshProUGUI> c in RES_TXT)
        {
            if(c.Key <= COUNT) 
            { 
                c.Value.transform.parent.gameObject.SetActive(true);
             
                //‚ÍÎ˛˜‡ÂÏ ÌÛÊÌÛ˛ ËÍÓÌÍÛ Ï‡ÒÒË‚‡ ËÍÓÌÓÍ
                Sprite s = Resources.Load<Sprite>("Canvas/AMOUNT/RES/ICONs_TYP/icon_" + GL.TYP_MINING[c.Key - 1]);
                c.Value.transform.parent.Find("ICON_TYP").GetComponent<Image>().sprite = s;
            }
            else
            { c.Value.transform.parent.gameObject.SetActive(false); }
        }
    }
    //-----------------------------------------------------------------------------------------------------------------
    //-----------------------------------------------------------------------------------------------------------------



    //-----------------------------------------------------------------------------------------------------------------
    //-----------------------------------------------------------------------------------------------------------------
    // Œ¡ÕŒ¬»“‹ «Õ¿◊≈Õ»≈ ¬—≈’ –≈—”–—Œ¬ (◊“Œ¡€ —–¿«” Œ¡ÕŒ¬»À»—‹ «Õ¿◊≈Õ»ﬂ œ–» —Ã≈Õ≈ —÷≈Õ€)
    public static void UPD_Res_ALL()
    {
        MONEY_TXT.text = SCORE_MONEY.ToString();

        int n = 1;
        foreach (string s in GL.TYP_MINING)
        {
            UPD_Res(s, n);
            n++;
        }
    }

    // Œ¡ÕŒ¬»“‹ «Õ¿◊≈Õ»≈ Œœ–≈ƒ≈À≈ÕÕŒ√Œ –≈—”–—¿
    public static void UPD_Res(string res, int n)
    {
        RES_TXT[n].text = RES[res].SCORE.ToString();
    }
    //-----------------------------------------------------------------------------------------------------------------
    //-----------------------------------------------------------------------------------------------------------------
}
