using UnityEngine;

public class GAME : MonoBehaviour
{
    //-----------------------------------------------------------------------------------------------------------------
    void Start()
    {
        // онксвхрэ янупюмеммше дюммше
        SAVE.GET();



        // хмхр бяеу щкелемрнб яжемш
        INITIALIZATION.I();



        // хмхр юйрсюкэмнцн янярнъмхъ яжемш
        RESOURCE_SCENE.SET(GL.name_mining_scene);
    }
    //-----------------------------------------------------------------------------------------------------------------





    //-----------------------------------------------------------------------------------------------------------------
    void Update()
    {
        // опнбепйю онксвемхъ пеяспянб (ЙНРНПШЕ ОН РЮИЛЕПС)
        RESOURCE_TIMER_GET.CHECK();



        // янупюмемхе он рюилепс 3ЯЕЙ
        SAVE.TIMER_SAVE();
    }
    //-----------------------------------------------------------------------------------------------------------------
}
