using UnityEngine;

public class GAME : MonoBehaviour
{
    //-----------------------------------------------------------------------------------------------------------------
    void Start()
    {
        // онксвхрэ янупюмеммше дюммше
        SAVE.GET();



        // хмхр бяеу щкелемрнб яжемш
        INITIALIZATION.I();



        // хмхр юйрсюкэмнцн янярнъмхъ яжемш
        SCENE_MINING.SET();
    }
    //-----------------------------------------------------------------------------------------------------------------





    //-----------------------------------------------------------------------------------------------------------------
    void Update()
    {
        // рюилеп хцпш
        GL.time = Time.time;



        // опнбепйю онксвемхъ пеяспянб (ЙНРНПШЕ ОН РЮИЛЕПС)
        TIMER_GET_RESOURCE.CHECK();



        // янупюмемхе он рюилепс 3ЯЕЙ
        SAVE.TIMER_SAVE();
    }
    //-----------------------------------------------------------------------------------------------------------------
}
