using UnityEngine;

public class INITIALIZATION : MonoBehaviour
{
    //-----------------------------------------------------------------------------------------------------------------
    public static void I()
    {
        // ЙНККЕЙЖХХ ПЕЯСПЯНБ
        RESOURCE_INIT.I();


        // UI пеяспянб
        UI_RESOURCE.I();


        // яйкюдю (бяеу опндсйрнб)
        WAREHOUSE_INIT.I();


        // ймнонй
        BUTTONS.I();
    }
    //-----------------------------------------------------------------------------------------------------------------
}
