using UnityEngine;

public class INITIALIZATION : MonoBehaviour
{
    //-----------------------------------------------------------------------------------------------------------------
    public static void I()
    {
        // коллекции ресурсов
        RESOURCE_INIT.I();


        // UI РЕСУРСОВ
        UI_RESOURCE.I();


        // ВСЕХ ПРОДУКТОВ
        WAREHOUSE.INIT();


        // КНОПОК
        BUTTONS.I();
    }
    //-----------------------------------------------------------------------------------------------------------------
}
