using System.Security.Cryptography;
using UnityEngine;

public class SAVE : MonoBehaviour
{
    //-----------------------------------------------------------------------------------------------------------------
    static float time_save;
    //-----------------------------------------------------------------------------------------------------------------



    //-----------------------------------------------------------------------------------------------------------------
    // онксвемхе янупюмеммшу дюммшу
    public static void GET()
    {
        GL.name_mining_scene = PlayerPrefs.GetString("name_mining_scene", "BLACK");


        // онксвхрэ дюммше н пеяспяюу (ХГ json)
        SAVE_RESOURCE.GET();
    }
    //-----------------------------------------------------------------------------------------------------------------




    //-----------------------------------------------------------------------------------------------------------------
    // янупюмхрэ дюммше он рюилепс 3ЯЕЙ
    public static void TIMER_SAVE()
    {
        if (time_save > GL.time) { return; }
        time_save = GL.time + 3;

        PlayerPrefs.SetString("name_mining_scene", GL.name_mining_scene);


        // янупюмхрэ дюммше н пеяспюяу (Б json)
        SAVE_RESOURCE.SET();
    }
    //-----------------------------------------------------------------------------------------------------------------
}
